STL_IGU_28_N2_AER1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet1
    {
      type               calculated;
      value              $internalField;
    }
    inlet2
    {
      type               calculated;
      value              $internalField;
    }
    outlet
    {
      type               calculated;
      value              $internalField;
    }
    door
    {
        type               calculated;
        value              $internalField;
    }
    windowsmall
    {
        type               calculated;
        value              $internalField;

    }
    windowbig
    {
        type               calculated;
        value              $internalField;
    }
    columns
    {
        type               calculated;
        value              $internalField;
    }
    ceiling
    {
        type               calculated;
        value              $internalField;
    }
    floor
    {
        type               calculated;
        value              $internalField;
    }
    wallwindow
    {
        type               calculated;
        value              $internalField;
    }
    walldoor
    {
        type               calculated;
        value              $internalField;
    }
    walloutside
    {
        type               calculated;
        value              $internalField;
    }
    wallinside
    {
        type               calculated;
        value              $internalField;
    }
    emission_surface
    {
        type               calculated;
        value              $internalField;
    }
    n_001
    {
        type               calculated;
        value              $internalField;
    }
    n_002
    {
        type               calculated;
        value              $internalField;
    }
}


// ************************************************************************* //
